tap "common-fate/granted"
tap "databricks/tap"
tap "datamindedbe/conveyor-formulas"
tap "gitpod-io/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jvanbuel/flowrs"
tap "jvanbuel/pattrick"
tap "kdash-rs/kdash"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "microsoft/mssql-release"
tap "mike-engel/jwt-cli"
tap "minio/stable"
tap "raito-io/tap"
tap "romkatv/powerlevel10k"
tap "thezoraiz/ascii-image-converter"
tap "timvw/tap"
tap "turbot/tap"
tap "xo/xo"
brew "act"
brew "adr-tools"
brew "certifi"
brew "zstd"
brew "openssl@3"
brew "aider"
brew "argocd"
brew "atuin"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "azcopy"
brew "azure-cli"
brew "gettext"
brew "bash"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "bitwarden-cli"
brew "bottom"
brew "cdktf"
brew "checkov"
brew "cmake"
brew "cmatrix"
brew "cookiecutter"
brew "coreutils"
brew "cruft"
brew "cryptography"
brew "curl", link: true
brew "deno"
brew "difftastic"
brew "dua-cli"
brew "duckdb"
brew "dust"
brew "elixir"
brew "extra-cmake-modules"
brew "eza"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libssh"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glances"
brew "gnu-sed"
brew "gnu-tar"
brew "golangci-lint"
brew "goreleaser"
brew "librsvg"
brew "graphviz"
brew "hadolint"
brew "helm"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "jj"
brew "jq"
brew "just"
brew "k6"
brew "k9s"
brew "karchive"
brew "kdoctools"
brew "ki18n"
brew "kiota"
brew "kube-linter"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "libpq"
brew "lima"
brew "llvm"
brew "make"
brew "mise"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "nginx"
brew "nvm"
brew "openapi-generator"
brew "openshift-cli"
brew "openssl@1.1"
brew "opentofu"
brew "pandoc"
brew "pipenv"
brew "pipx"
brew "pnpm"
brew "podman"
brew "poetry"
brew "postgresql@14"
brew "powerlevel10k"
brew "pre-commit"
brew "presenterm"
brew "protobuf"
brew "python@3.10"
brew "python@3.11"
brew "pytorch"
brew "qemu"
brew "qt"
brew "qt@5"
brew "rclone"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "rustup"
brew "saml2aws"
brew "shellcheck"
brew "slides"
brew "spotifyd"
brew "sslscan"
brew "starship"
brew "swagger-codegen"
brew "telnet"
brew "tflint"
brew "threadweaver"
brew "tiff2png"
brew "timg"
brew "tlrc"
brew "tmux"
brew "trivy"
brew "uv"
brew "vhs"
brew "virtualenv"
brew "watch"
brew "wget"
brew "wrk"
brew "yarn"
brew "yq"
brew "zig"
brew "zola"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "common-fate/granted/granted"
brew "databricks/tap/databricks"
brew "datamindedbe/conveyor-formulas/conveyor"
brew "gitpod-io/tap/gitpod"
brew "jesseduffield/lazydocker/lazydocker"
brew "jvanbuel/flowrs/flowrs"
brew "jvanbuel/pattrick/pattrick"
brew "kdash-rs/kdash/kdash"
brew "kde-mac/kde/kdiagram"
brew "kde-mac/kde/kf5-kcoreaddons"
brew "kde-mac/kde/kf5-kitemmodels"
brew "minio/stable/mc"
brew "turbot/tap/steampipe"
cask "alacritty"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "maccy"
cask "netron"
cask "quarto"
cask "tomatobar"
cask "tunnelblick"
vscode "albert.tabout"
vscode "antfu.slidev"
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "coder.coder-remote"
vscode "deepnote.vscode-deepnote"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dorzey.vscode-sqlfluff"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "elijah-potter.harper"
vscode "esbenp.prettier-vscode"
vscode "evidence.evidence-vscode"
vscode "exiasr.hadolint"
vscode "franneck94.workspace-formatter"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-flex"
vscode "gleam.gleam"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "irongeek.vscode-env"
vscode "james-yu.latex-workshop"
vscode "justusadam.language-haskell"
vscode "kamikillerto.vscode-colorize"
vscode "linhmtran168.mac-ca-vscode"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marp-team.marp-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "myriad-dreamin.tinymist"
vscode "nefrob.vscode-just-syntax"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "saoudrizwan.claude-dev"
vscode "savh.json5-kit"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "yassun7010.vscode-shandy-sqlfmt"
vscode "zainchen.json"
go "golang.org/x/tools/gopls"
go "prick"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/xo/usql"
cargo "cargo-smart-release"
cargo "clean-dev-dirs"
cargo "cross"
cargo "release-plz"
cargo "starship-jj"
