tap "datamindedbe/conveyor-formulas"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jvanbuel/pattrick"
tap "kdash-rs/kdash"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "microsoft/mssql-release"
tap "raito-io/tap"
tap "romkatv/powerlevel10k"
tap "timvw/tap"
brew "zstd"
brew "atuin"
brew "openssl@3"
brew "python@3.11"
brew "awscli"
brew "azcopy"
brew "azure-cli"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "bottom"
brew "gettext"
brew "node"
brew "cdktf"
brew "cmake"
brew "cmatrix"
brew "cookiecutter"
brew "cruft"
brew "deno"
brew "dua-cli"
brew "duckdb"
brew "extra-cmake-modules"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "glances"
brew "gnu-sed"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "golangci-lint"
brew "helm"
brew "htop"
brew "hyperfine"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "libssh"
brew "llvm"
brew "make"
brew "mise"
brew "neovim"
brew "nvm"
brew "openssl@1.1"
brew "pipx"
brew "podman"
brew "powerlevel10k"
brew "pre-commit"
brew "protobuf"
brew "python@3.10"
brew "pytorch"
brew "qemu"
brew "qt@5"
brew "ripgrep"
brew "rust"
brew "rustup-init"
brew "saml2aws"
brew "spotifyd", restart_service: true
brew "tflint"
brew "threadweaver"
brew "tmux"
brew "virtualenv"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "datamindedbe/conveyor-formulas/conveyor"
brew "jvanbuel/pattrick/pattrick"
brew "kdash-rs/kdash/kdash"
brew "kde-mac/kde/kf5-kcoreaddons"
brew "kde-mac/kde/kf5-kitemmodels"
brew "raito-io/tap/cli"
cask "alacritty"
cask "dbeaver-community"
cask "dotnet"
cask "font-hack-nerd-font"
cask "netron"
cask "ngrok"
vscode "4ops.terraform"
vscode "adpyke.vscode-sql-formatter"
vscode "albert.tabout"
vscode "ardenivanov.svelte-intellisense"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "coder.coder-remote"
vscode "cweijan.vscode-office"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "franneck94.workspace-formatter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "irongeek.vscode-env"
vscode "justusadam.language-haskell"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rapidapi.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "zxh404.vscode-proto3"
