tap "databricks/tap"
tap "datamindedbe/conveyor-formulas"
tap "goreleaser/tap"
tap "hangxie/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jvanbuel/pattrick"
tap "kdash-rs/kdash"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "microsoft/mssql-release"
tap "mike-engel/jwt-cli"
tap "minio/stable"
tap "raito-io/tap"
tap "romkatv/powerlevel10k"
tap "thezoraiz/ascii-image-converter"
tap "timvw/tap"
tap "turbot/tap"
brew "act"
brew "adr-tools"
brew "zstd"
brew "argocd"
brew "atuin"
brew "ca-certificates"
brew "openssl@3"
brew "node"
brew "aws-cdk"
brew "cryptography"
brew "python@3.12"
brew "awscli"
brew "azcopy"
brew "python@3.11"
brew "azure-cli"
brew "bash"
brew "libssh2"
brew "bat"
brew "bottom"
brew "gettext"
brew "cdktf"
brew "openblas"
brew "checkov"
brew "cmake"
brew "cmatrix"
brew "cookiecutter"
brew "coreutils"
brew "cruft"
brew "deno"
brew "difftastic"
brew "dotnet", link: false
brew "dua-cli"
brew "duckdb"
brew "extra-cmake-modules"
brew "libgit2"
brew "eza"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glances"
brew "gnu-sed"
brew "golangci-lint"
brew "goreleaser"
brew "graphviz"
brew "helm"
brew "htop"
brew "hyperfine"
brew "jq"
brew "k6"
brew "k9s"
brew "qt"
brew "karchive"
brew "kdoctools"
brew "ki18n"
brew "kiota"
brew "kubernetes-cli"
brew "kubectx"
brew "libpq"
brew "lima"
brew "llvm"
brew "make"
brew "mise"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "nvm"
brew "openapi-generator"
brew "openshift-cli"
brew "openssl@1.1"
brew "pipenv"
brew "pipx"
brew "pnpm"
brew "podman"
brew "poetry"
brew "powerlevel10k"
brew "pre-commit"
brew "protobuf"
brew "python@3.10"
brew "pytorch"
brew "qemu"
brew "rclone"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "rustup"
brew "saml2aws"
brew "spotify-tui"
brew "spotifyd", restart_service: true
brew "swagger-codegen"
brew "tflint"
brew "threadweaver"
brew "timg"
brew "tmux"
brew "trivy"
brew "uv"
brew "vhs"
brew "virtualenv"
brew "watch"
brew "wget"
brew "wrk"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "databricks/tap/databricks"
brew "datamindedbe/conveyor-formulas/conveyor"
brew "hangxie/tap/go-parquet-tools"
brew "jvanbuel/pattrick/pattrick"
brew "kdash-rs/kdash/kdash"
brew "kde-mac/kde/kdiagram"
brew "kde-mac/kde/kf5-kcoreaddons"
brew "kde-mac/kde/kf5-kconfigwidgets"
brew "kde-mac/kde/kf5-kio"
brew "kde-mac/kde/kf5-kitemmodels"
brew "microsoft/mssql-release/msodbcsql17"
brew "microsoft/mssql-release/mssql-tools"
brew "mike-engel/jwt-cli/jwt-cli"
brew "minio/stable/mc"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
brew "turbot/tap/steampipe"
cask "alacritty"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "dotnet"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "maccy"
cask "mitmproxy"
cask "netron"
cask "ngrok"
cask "tunnelblick"
cask "zed"
vscode "4ops.terraform"
vscode "adpyke.vscode-sql-formatter"
vscode "albert.tabout"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "ardenivanov.svelte-intellisense"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "coder.coder-remote"
vscode "cweijan.vscode-office"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "franneck94.workspace-formatter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "irongeek.vscode-env"
vscode "james-yu.latex-workshop"
vscode "justusadam.language-haskell"
vscode "kamikillerto.vscode-colorize"
vscode "linhmtran168.mac-ca-vscode"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marp-team.marp-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rapidapi.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "zxh404.vscode-proto3"
